// ННГУ, ВМК, Курс "Методы программирования-2", С++, ООП
//
// sample_matrix.cpp - Copyright (c) Гергель В.П. 07.05.2001
//   Переработано для Microsoft Visual Studio 2008 Сысоевым А.В. (20.04.2015)
//
// Тестирование верхнетреугольной матрицы

#include <iostream>
#include "utmatrix.h"
//---------------------------------------------------------------------------

int main()
{
	TVector<int> v1(5);
	TVector<int> v(5, 3);

	v[3] = 3;
	v[4] = 4;
	v[5] = 5;

	v1 = v;

	std::cout << v1[3] << " ";
	std::cout << v1[4] << " ";
	std::cout << v1[5] << " ";


  return 0;
}
//---------------------------------------------------------------------------
